cases/NSGA_diffuser/baseCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (590 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (590 0 0);
        massFlowRate    constant 0.5;
        rhoInlet        0.4;    // Guess for rho
    }
    outlet
    {
        type            zeroGradient;
    }
    compressor
    {
        type            zeroGradient;
    }
    upper
    {
        type            inletOutlet;
        value           uniform (590 0 0);
        inletValue      uniform (590 0 0);
    }
    lower
    {
        type            inletOutlet;
        value           uniform (590 0 0);
        inletValue      uniform (590 0 0);
    }
    cowl
    {
        type            fixedValue;
    	value 			uniform (0 0 0);
    }
    axis
    {
        type            fixedValue;
    	value 			uniform (0 0 0);
    }
    defaultFaces
    {
    	type			empty;
    }
}


// ************************************************************************* //
