cases/NSGA_diffuser/baseCase/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 2;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    compressor
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    upper
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    lower
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    cowl
    {
        type            kqRWallFunction;
        value           uniform 2;
    }
    axis
    {
        type            kqRWallFunction;
        value           uniform 2;
    }
    defaultFaces
    {
    	type			empty;
    }
}


// ************************************************************************* //
