cases/NSGA_diffuser/baseCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 19330;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 19330;
    }
    outlet
    {
        type            zeroGradient;
        refValue        uniform 19330;
        refGradient     uniform 0;
        valueFraction   uniform 0.3;
    }
    compressor
    {
        type            zeroGradient;
        refValue        uniform 19330;
        refGradient     uniform 0;
        valueFraction   uniform 0.3;
    }
    upper
    {
        type            zeroGradient;
        refValue        uniform 19330;
        refGradient     uniform 0;
        valueFraction   uniform 0.3;
    }
    lower
    {
        type            zeroGradient;
        refValue        uniform 19330;
        refGradient     uniform 0;
        valueFraction   uniform 0.3;
    }
    cowl
    {
        type            zeroGradient;
    }
    axis
    {
        type            zeroGradient;
    }
    defaultFace
    {
    	type			empty;
    }
}


// ************************************************************************* //
