cases/NSGA_diffuser/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          250;
        startFace       235610;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       235860;
    }
    compressor
    {
        type            patch;
        nFaces          150;
        startFace       235940;
    }
    upper
    {
        type            patch;
        nFaces          440;
        startFace       236090;
    }
    lower
    {
        type            patch;
        nFaces          200;
        startFace       236530;
    }
    cowl
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       236730;
    }
    axis
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       236890;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          236400;
        startFace       237190;
    }
)

// ************************************************************************* //
