cases/NSGA_diffuser/baseCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
LsO 0.18117333;
ULcO 2.62614808;
DLcO 2.67614808;
TLcO 4.67614808;

z1  0.0; 
z2  0.1; 
Nup   80;
Nuu   40;
Ncowl 20;
Naxis 150;
Ninf  200;
Nramp 200;
Ndown 100;

convertToMeters 1;

vertices
(
	(1.0	0.0		$z1) // Point 0
	(2.0	0.0		$z1) // Point 1
	($DLcO	$LsO	$z1) // Point 2
	($TLcO	0.1		$z1) // Point 3
	(1.0	0.8		$z1) // Point 4
	(2.0	0.8		$z1) // Point 5
	($DLcO	0.8		$z1) // Point 6
	($TLcO	0.8		$z1) // Point 7
	(1.0	0.85	$z1) // Point 8
	(2.0	0.85	$z1) // Point 9
	($ULcO	0.85	$z1) // Point 10
	($TLcO	0.85	$z1) // Point 11
	(1.0	1.85	$z1) // Point 12
	(2.0	1.85	$z1) // Point 13
	($ULcO	1.85	$z1) // Point 14
	($TLcO	1.85	$z1) // Point 15

	(1.0	0.0		$z2) // Point 16
	(2.0	0.0		$z2) // Point 17
	($DLcO	$LsO	$z2) // Point 18
	($TLcO	0.1		$z2) // Point 19
	(1.0	0.8		$z2) // Point 20
	(2.0	0.8		$z2) // Point 21
	($DLcO	0.8		$z2) // Point 22
	($TLcO	0.8		$z2) // Point 23
	(1.0	0.85	$z2) // Point 24
	(2.0	0.85	$z2) // Point 25
	($ULcO	0.85	$z2) // Point 26
	($TLcO	0.85	$z2) // Point 27
	(1.0	1.85	$z2) // Point 28
	(2.0	1.85	$z2) // Point 29
	($ULcO	1.85	$z2) // Point 30
	($TLcO	1.85	$z2) // Point 31
);

blocks
(
	//block 0
    hex (0 1 5 4 16 17 21 20) ($Ninf $Naxis 1) simpleGrading
    (
    	0.1
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )    
    //block 1
    hex (1 2 6 5 17 18 22 21) ($Nramp $Naxis 1) simpleGrading
    (
    	1
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )
    //block 2
    hex (2 3 7 6 18 19 23 22) ($Ndown $Naxis 1) simpleGrading 		
    (
    	10
    	(
    		(0.10		0.15	1)
    		(0.40		0.35	3.2)
    		(0.40		0.35	0.3125)
    		(0.10		0.15	1)
		)   	
    	1
    )
    //block 3
    hex (4 5 9 8 20 21 25 24) ($Ninf $Ncowl 1) simpleGrading (0.1 1 1)
    //block 4
    hex (5 6 10 9 21 22 26 25) ($Nramp $Ncowl 1) simpleGrading (1 1 1)
    //block 5
    hex (8 9 13 12 24 25 29 28) ($Ninf $Nup 1) simpleGrading (0.1 15 1)
    //block 6
    hex (9 10 14 13 25 26 30 29) ($Nramp $Nup 1) simpleGrading (1 15 1)
    //block 7
    hex (10 11 15 14 26 27 31 30) ($Nuu $Nup 1) simpleGrading (10 15 1)
);

edges
(    spline 2 3 ( 
        (2.67614808 0.18117333 0.0) 
        (2.69635010 0.18056984 0.0) 
        (2.71655212 0.17996193 0.0) 
        (2.73675414 0.17934960 0.0) 
        (2.75695616 0.17873286 0.0) 
        (2.77715818 0.17811170 0.0) 
        (2.79736020 0.17748612 0.0) 
        (2.81756222 0.17685612 0.0) 
        (2.83776424 0.17622171 0.0) 
        (2.85796626 0.17558288 0.0) 
        (2.87816828 0.17493963 0.0) 
        (2.89837030 0.17429197 0.0) 
        (2.91857232 0.17363989 0.0) 
        (2.93877434 0.17298339 0.0) 
        (2.95897636 0.17232248 0.0) 
        (2.97917838 0.17165714 0.0) 
        (2.99938040 0.17098739 0.0) 
        (3.01958242 0.17031323 0.0) 
        (3.03978444 0.16963464 0.0) 
        (3.05998646 0.16895164 0.0) 
        (3.08018848 0.16826422 0.0) 
        (3.10039050 0.16757239 0.0) 
        (3.12059252 0.16687614 0.0) 
        (3.14079454 0.16617547 0.0) 
        (3.16099656 0.16547038 0.0) 
        (3.18119858 0.16476088 0.0) 
        (3.20140060 0.16404695 0.0) 
        (3.22160262 0.16332862 0.0) 
        (3.24180464 0.16260586 0.0) 
        (3.26200666 0.16187869 0.0) 
        (3.28220868 0.16114710 0.0) 
        (3.30241070 0.16041109 0.0) 
        (3.32261272 0.15967067 0.0) 
        (3.34281475 0.15892583 0.0) 
        (3.36301677 0.15817657 0.0) 
        (3.38321879 0.15742289 0.0) 
        (3.40342081 0.15666480 0.0) 
        (3.42362283 0.15590229 0.0) 
        (3.44382485 0.15513536 0.0) 
        (3.46402687 0.15436402 0.0) 
        (3.48422889 0.15358826 0.0) 
        (3.50443091 0.15280808 0.0) 
        (3.52463293 0.15202348 0.0) 
        (3.54483495 0.15123447 0.0) 
        (3.56503697 0.15044104 0.0) 
        (3.58523899 0.14964319 0.0) 
        (3.60544101 0.14884093 0.0) 
        (3.62564303 0.14803425 0.0) 
        (3.64584505 0.14722315 0.0) 
        (3.66604707 0.14640764 0.0) 
        (3.68624909 0.14558770 0.0) 
        (3.70645111 0.14476335 0.0) 
        (3.72665313 0.14393459 0.0) 
        (3.74685515 0.14310140 0.0) 
        (3.76705717 0.14226380 0.0) 
        (3.78725919 0.14142178 0.0) 
        (3.80746121 0.14057535 0.0) 
        (3.82766323 0.13972449 0.0) 
        (3.84786525 0.13886922 0.0) 
        (3.86806727 0.13800954 0.0) 
        (3.88826929 0.13714543 0.0) 
        (3.90847131 0.13627691 0.0) 
        (3.92867333 0.13540397 0.0) 
        (3.94887535 0.13452662 0.0) 
        (3.96907737 0.13364485 0.0) 
        (3.98927939 0.13275866 0.0) 
        (4.00948141 0.13186805 0.0) 
        (4.02968343 0.13097302 0.0) 
        (4.04988545 0.13007358 0.0) 
        (4.07008747 0.12916972 0.0) 
        (4.09028949 0.12826145 0.0) 
        (4.11049151 0.12734876 0.0) 
        (4.13069353 0.12643165 0.0) 
        (4.15089555 0.12551012 0.0) 
        (4.17109757 0.12458418 0.0) 
        (4.19129959 0.12365381 0.0) 
        (4.21150161 0.12271904 0.0) 
        (4.23170363 0.12177984 0.0) 
        (4.25190565 0.12083623 0.0) 
        (4.27210767 0.11988820 0.0) 
        (4.29230969 0.11893575 0.0) 
        (4.31251171 0.11797889 0.0) 
        (4.33271373 0.11701761 0.0) 
        (4.35291576 0.11605191 0.0) 
        (4.37311778 0.11508179 0.0) 
        (4.39331980 0.11410726 0.0) 
        (4.41352182 0.11312831 0.0) 
        (4.43372384 0.11214494 0.0) 
        (4.45392586 0.11115716 0.0) 
        (4.47412788 0.11016496 0.0) 
        (4.49432990 0.10916834 0.0) 
        (4.51453192 0.10816730 0.0) 
        (4.53473394 0.10716185 0.0) 
        (4.55493596 0.10615198 0.0) 
        (4.57513798 0.10513769 0.0) 
        (4.59534000 0.10411899 0.0) 
        (4.61554202 0.10309587 0.0) 
        (4.63574404 0.10206833 0.0) 
        (4.65594606 0.10103637 0.0) 
        (4.67614808 0.10000000 0.0) 
        ) 
    spline 18 19 ( 
        (2.67614808 0.18117333 0.1) 
        (2.69635010 0.18056984 0.1) 
        (2.71655212 0.17996193 0.1) 
        (2.73675414 0.17934960 0.1) 
        (2.75695616 0.17873286 0.1) 
        (2.77715818 0.17811170 0.1) 
        (2.79736020 0.17748612 0.1) 
        (2.81756222 0.17685612 0.1) 
        (2.83776424 0.17622171 0.1) 
        (2.85796626 0.17558288 0.1) 
        (2.87816828 0.17493963 0.1) 
        (2.89837030 0.17429197 0.1) 
        (2.91857232 0.17363989 0.1) 
        (2.93877434 0.17298339 0.1) 
        (2.95897636 0.17232248 0.1) 
        (2.97917838 0.17165714 0.1) 
        (2.99938040 0.17098739 0.1) 
        (3.01958242 0.17031323 0.1) 
        (3.03978444 0.16963464 0.1) 
        (3.05998646 0.16895164 0.1) 
        (3.08018848 0.16826422 0.1) 
        (3.10039050 0.16757239 0.1) 
        (3.12059252 0.16687614 0.1) 
        (3.14079454 0.16617547 0.1) 
        (3.16099656 0.16547038 0.1) 
        (3.18119858 0.16476088 0.1) 
        (3.20140060 0.16404695 0.1) 
        (3.22160262 0.16332862 0.1) 
        (3.24180464 0.16260586 0.1) 
        (3.26200666 0.16187869 0.1) 
        (3.28220868 0.16114710 0.1) 
        (3.30241070 0.16041109 0.1) 
        (3.32261272 0.15967067 0.1) 
        (3.34281475 0.15892583 0.1) 
        (3.36301677 0.15817657 0.1) 
        (3.38321879 0.15742289 0.1) 
        (3.40342081 0.15666480 0.1) 
        (3.42362283 0.15590229 0.1) 
        (3.44382485 0.15513536 0.1) 
        (3.46402687 0.15436402 0.1) 
        (3.48422889 0.15358826 0.1) 
        (3.50443091 0.15280808 0.1) 
        (3.52463293 0.15202348 0.1) 
        (3.54483495 0.15123447 0.1) 
        (3.56503697 0.15044104 0.1) 
        (3.58523899 0.14964319 0.1) 
        (3.60544101 0.14884093 0.1) 
        (3.62564303 0.14803425 0.1) 
        (3.64584505 0.14722315 0.1) 
        (3.66604707 0.14640764 0.1) 
        (3.68624909 0.14558770 0.1) 
        (3.70645111 0.14476335 0.1) 
        (3.72665313 0.14393459 0.1) 
        (3.74685515 0.14310140 0.1) 
        (3.76705717 0.14226380 0.1) 
        (3.78725919 0.14142178 0.1) 
        (3.80746121 0.14057535 0.1) 
        (3.82766323 0.13972449 0.1) 
        (3.84786525 0.13886922 0.1) 
        (3.86806727 0.13800954 0.1) 
        (3.88826929 0.13714543 0.1) 
        (3.90847131 0.13627691 0.1) 
        (3.92867333 0.13540397 0.1) 
        (3.94887535 0.13452662 0.1) 
        (3.96907737 0.13364485 0.1) 
        (3.98927939 0.13275866 0.1) 
        (4.00948141 0.13186805 0.1) 
        (4.02968343 0.13097302 0.1) 
        (4.04988545 0.13007358 0.1) 
        (4.07008747 0.12916972 0.1) 
        (4.09028949 0.12826145 0.1) 
        (4.11049151 0.12734876 0.1) 
        (4.13069353 0.12643165 0.1) 
        (4.15089555 0.12551012 0.1) 
        (4.17109757 0.12458418 0.1) 
        (4.19129959 0.12365381 0.1) 
        (4.21150161 0.12271904 0.1) 
        (4.23170363 0.12177984 0.1) 
        (4.25190565 0.12083623 0.1) 
        (4.27210767 0.11988820 0.1) 
        (4.29230969 0.11893575 0.1) 
        (4.31251171 0.11797889 0.1) 
        (4.33271373 0.11701761 0.1) 
        (4.35291576 0.11605191 0.1) 
        (4.37311778 0.11508179 0.1) 
        (4.39331980 0.11410726 0.1) 
        (4.41352182 0.11312831 0.1) 
        (4.43372384 0.11214494 0.1) 
        (4.45392586 0.11115716 0.1) 
        (4.47412788 0.11016496 0.1) 
        (4.49432990 0.10916834 0.1) 
        (4.51453192 0.10816730 0.1) 
        (4.53473394 0.10716185 0.1) 
        (4.55493596 0.10615198 0.1) 
        (4.57513798 0.10513769 0.1) 
        (4.59534000 0.10411899 0.1) 
        (4.61554202 0.10309587 0.1) 
        (4.63574404 0.10206833 0.1) 
        (4.65594606 0.10103637 0.1) 
        (4.67614808 0.10000000 0.1) 
        ) 

);

boundary
(
	inlet
    {
        type patch;
        faces
        (
            (12 28 24 8)
            (8 24 20 4)
            (4 20 16 0)
        );
    }   

	outlet
    {
        type patch;
        faces
        (
            (31 15 11 27)
        );
    }   

	compressor
    {
        type patch;
        faces
        (
            (23 7 3 19)
        );
    }   

	upper
    {
        type patch;
        faces
        (
            (28 12 13 29)
            (29 13 14 30)
            (30 14 15 31)
        );
    }   

	lower
    {
        type patch;
        faces
        (
            (0 16 17 1)
        );
    }   
    
	cowl
    {
        type wall;
        faces
        (
            (10 26 27 11)
            (26 10 6 22)
            (22 6 7 23)
        );
    }   

	axis
    {
        type wall;
        faces
        (
            (18 2 1 17)
            (19 3 2 18)
        );
    }   
);

// ************************************************************************* //
